; domain
(define (domain elevators_sequencedstrips_p8_3_1-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types
    elevator passenger count - object
    slow_elevator fast_elevator - elevator
 )
 (:predicates (passenger_at ?person - passenger ?floor - count) (boarded ?person - passenger ?lift - elevator) (lift_at ?lift - elevator ?floor - count) (reachable_floor ?lift - elevator ?floor - count) (above ?floor1 - count ?floor2 - count) (passengers ?lift - elevator ?n - count) (can_hold ?lift - elevator ?n - count) (next ?n1 - count ?n2 - count))
 (:functions (total_cost) (travel_slow ?f1 - count ?f2 - count) (travel_fast ?f1 - count ?f2 - count))
 (:action move_up_slow
  :parameters ( ?lift_0 - slow_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_0 ?f1) (above ?f1 ?f2) (reachable_floor ?lift_0 ?f2))
  :effect (and (lift_at ?lift_0 ?f2) (not (lift_at ?lift_0 ?f1)) (increase (total_cost) (travel_slow ?f1 ?f2))))
 (:action move_down_slow
  :parameters ( ?lift_0 - slow_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_0 ?f1) (above ?f2 ?f1) (reachable_floor ?lift_0 ?f2))
  :effect (and (lift_at ?lift_0 ?f2) (not (lift_at ?lift_0 ?f1)) (increase (total_cost) (travel_slow ?f2 ?f1))))
 (:action move_up_fast
  :parameters ( ?lift_1 - fast_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_1 ?f1) (above ?f1 ?f2) (reachable_floor ?lift_1 ?f2))
  :effect (and (lift_at ?lift_1 ?f2) (not (lift_at ?lift_1 ?f1)) (increase (total_cost) (travel_fast ?f1 ?f2))))
 (:action move_down_fast
  :parameters ( ?lift_1 - fast_elevator ?f1 - count ?f2 - count)
  :precondition (and (lift_at ?lift_1 ?f1) (above ?f2 ?f1) (reachable_floor ?lift_1 ?f2))
  :effect (and (lift_at ?lift_1 ?f2) (not (lift_at ?lift_1 ?f1)) (increase (total_cost) (travel_fast ?f2 ?f1))))
 (:action board
  :parameters ( ?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and (lift_at ?lift ?f) (passenger_at ?p ?f) (passengers ?lift ?n1) (next ?n1 ?n2) (can_hold ?lift ?n2))
  :effect (and (not (passenger_at ?p ?f)) (boarded ?p ?lift) (not (passengers ?lift ?n1)) (passengers ?lift ?n2)))
 (:action leave
  :parameters ( ?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and (lift_at ?lift ?f) (boarded ?p ?lift) (passengers ?lift ?n1) (next ?n2 ?n1))
  :effect (and (passenger_at ?p ?f) (not (boarded ?p ?lift)) (not (passengers ?lift ?n1)) (passengers ?lift ?n2)))
)

; problem
(define (problem elevators_sequencedstrips_p8_3_1-problem)
 (:domain elevators_sequencedstrips_p8_3_1-domain)
 (:objects
   slow0_0 slow1_0 - slow_elevator
   fast0 - fast_elevator
   p0 p1 p2 - passenger
   n0 n1 n2 n3 n4 n5 n6 n7 n8 - count
 )
 (:init (next n0 n1) (next n1 n2) (next n2 n3) (next n3 n4) (next n4 n5) (next n5 n6) (next n6 n7) (next n7 n8) (above n0 n1) (above n0 n2) (above n0 n3) (above n0 n4) (above n0 n5) (above n0 n6) (above n0 n7) (above n0 n8) (above n1 n2) (above n1 n3) (above n1 n4) (above n1 n5) (above n1 n6) (above n1 n7) (above n1 n8) (above n2 n3) (above n2 n4) (above n2 n5) (above n2 n6) (above n2 n7) (above n2 n8) (above n3 n4) (above n3 n5) (above n3 n6) (above n3 n7) (above n3 n8) (above n4 n5) (above n4 n6) (above n4 n7) (above n4 n8) (above n5 n6) (above n5 n7) (above n5 n8) (above n6 n7) (above n6 n8) (above n7 n8) (lift_at fast0 n0) (passengers fast0 n0) (can_hold fast0 n1) (can_hold fast0 n2) (can_hold fast0 n3) (reachable_floor fast0 n0) (reachable_floor fast0 n2) (reachable_floor fast0 n4) (reachable_floor fast0 n6) (reachable_floor fast0 n8) (lift_at slow0_0 n2) (passengers slow0_0 n0) (can_hold slow0_0 n1) (can_hold slow0_0 n2) (reachable_floor slow0_0 n0) (reachable_floor slow0_0 n1) (reachable_floor slow0_0 n2) (reachable_floor slow0_0 n3) (reachable_floor slow0_0 n4) (lift_at slow1_0 n4) (passengers slow1_0 n0) (can_hold slow1_0 n1) (can_hold slow1_0 n2) (reachable_floor slow1_0 n4) (reachable_floor slow1_0 n5) (reachable_floor slow1_0 n6) (reachable_floor slow1_0 n7) (reachable_floor slow1_0 n8) (passenger_at p0 n8) (passenger_at p1 n3) (passenger_at p2 n2) (= (travel_slow n0 n1) 6) (= (travel_slow n0 n2) 7) (= (travel_slow n0 n3) 8) (= (travel_slow n0 n4) 9) (= (travel_slow n1 n2) 6) (= (travel_slow n1 n3) 7) (= (travel_slow n1 n4) 8) (= (travel_slow n2 n3) 6) (= (travel_slow n2 n4) 7) (= (travel_slow n3 n4) 6) (= (travel_slow n4 n5) 6) (= (travel_slow n4 n6) 7) (= (travel_slow n4 n7) 8) (= (travel_slow n4 n8) 9) (= (travel_slow n5 n6) 6) (= (travel_slow n5 n7) 7) (= (travel_slow n5 n8) 8) (= (travel_slow n6 n7) 6) (= (travel_slow n6 n8) 7) (= (travel_slow n7 n8) 6) (= (travel_fast n0 n2) 7) (= (travel_fast n0 n4) 13) (= (travel_fast n0 n6) 19) (= (travel_fast n0 n8) 25) (= (travel_fast n2 n4) 7) (= (travel_fast n2 n6) 13) (= (travel_fast n2 n8) 19) (= (travel_fast n4 n6) 7) (= (travel_fast n4 n8) 13) (= (travel_fast n6 n8) 7) (= (total_cost) 0))
 (:goal (and (passenger_at p0 n4) (passenger_at p1 n6) (passenger_at p2 n1)))
 (:metric minimize (total_cost))
)

; plan
1. (move_up_fast fast0 n0 n2)
   deleted: (lift_at fast0 n0)
   added: (lift_at fast0 n2)
   changed: (total_cost) from 0 to 7
   goals met: 0 of 3
2. (move_up_slow slow1_0 n4 n8)
   deleted: (lift_at slow1_0 n4)
   added: (lift_at slow1_0 n8)
   changed: (total_cost) from 7 to 16
   goals met: 0 of 3
3. (board p2 slow0_0 n2 n0 n1)
   deleted: (passenger_at p2 n2) (passengers slow0_0 n0)
   added: (boarded p2 slow0_0) (passengers slow0_0 n1)
   goals met: 0 of 3
4. (board p0 slow1_0 n8 n0 n1)
   deleted: (passenger_at p0 n8) (passengers slow1_0 n0)
   added: (boarded p0 slow1_0) (passengers slow1_0 n1)
   goals met: 0 of 3
5. (move_down_slow slow1_0 n8 n4)
   deleted: (lift_at slow1_0 n8)
   added: (lift_at slow1_0 n4)
   changed: (total_cost) from 16 to 25
   goals met: 0 of 3
6. (move_up_slow slow0_0 n2 n3)
   deleted: (lift_at slow0_0 n2)
   added: (lift_at slow0_0 n3)
   changed: (total_cost) from 25 to 31
   goals met: 0 of 3
7. (board p1 slow0_0 n3 n1 n2)
   deleted: (passenger_at p1 n3) (passengers slow0_0 n1)
   added: (boarded p1 slow0_0) (passengers slow0_0 n2)
   goals met: 0 of 3
8. (move_down_slow slow0_0 n3 n1)
   deleted: (lift_at slow0_0 n3)
   added: (lift_at slow0_0 n1)
   changed: (total_cost) from 31 to 38
   goals met: 0 of 3
9. (leave p2 slow0_0 n1 n2 n1)
   deleted: (boarded p2 slow0_0) (passengers slow0_0 n2)
   added: (passenger_at p2 n1) (passengers slow0_0 n1)
   goals met: 1 of 3
10. (move_up_slow slow0_0 n1 n4)
   deleted: (lift_at slow0_0 n1)
   added: (lift_at slow0_0 n4)
   changed: (total_cost) from 38 to 46
   goals met: 1 of 3
11. (leave p1 slow0_0 n4 n1 n0)
   deleted: (boarded p1 slow0_0) (passengers slow0_0 n1)
   added: (passenger_at p1 n4) (passengers slow0_0 n0)
   goals met: 1 of 3
12. (move_down_slow slow0_0 n4 n0)
   deleted: (lift_at slow0_0 n4)
   added: (lift_at slow0_0 n0)
   changed: (total_cost) from 46 to 55
   goals met: 1 of 3
13. (leave p0 slow1_0 n4 n1 n0)
   deleted: (boarded p0 slow1_0) (passengers slow1_0 n1)
   added: (passenger_at p0 n4) (passengers slow1_0 n0)
   goals met: 2 of 3
14. (board p1 slow1_0 n4 n0 n1)
   deleted: (passenger_at p1 n4) (passengers slow1_0 n0)
   added: (boarded p1 slow1_0) (passengers slow1_0 n1)
   goals met: 2 of 3
15. (move_up_slow slow1_0 n4 n6)
   deleted: (lift_at slow1_0 n4)
   added: (lift_at slow1_0 n6)
   changed: (total_cost) from 55 to 62
   goals met: 2 of 3
16. (leave p1 slow1_0 n6 n1 n0)
   deleted: (boarded p1 slow1_0) (passengers slow1_0 n1)
   added: (passenger_at p1 n6) (passengers slow1_0 n0)
   goals met: 3 of 3
